app/controllers/products_controller.rb

   def create
  	params.permit!
    #byebug
   @product=Product.new(params[:product])
   if @product.save
---
INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "mr"], ["description", "lakshmi"], ["price", ""], ["created_at", "2015-07-07 15:30:51.860622"], ["updated_at", "2015-07-07 15:30:51.860622"]]

  def update
  	params.permit!
   @product=Product.find(params[:id])
   if @product.update_attributes(params[:product])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "title" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "lakshmi"], ["description", "srilekha"], ["price", "love"], ["updated_at", "2015-07-21 15:41:34.849898"], ["id", 6]]

  def index
  	@product=Product.all
---
SELECT "products".* FROM "products"

  def destroy
  	@product=Product.find(params[:id])
  	@product.delete
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 4]]