app/controllers/users_controller.rb

   def create
  	params.permit!
    #byebug
   @user=User.new(params[:user])
   if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "lakshmi"], ["email", "lvenkatesh@gmail.com"], ["password", "123456"], ["created_at", "2015-07-26 13:36:00.782050"], ["updated_at", "2015-07-26 13:36:00.782050"]]

  def destroy
  	@user=User.find(params[:id])
  	@user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]